# todo: Шифр Цезаря
# Описание шифра.
# В криптографии шифр Цезаря, также известный шифр сдвига, код Цезаря или сдвиг Цезаря,
# является одним из самых простых и широко известных методов шифрования.
# Это тип подстановочного шифра, в котором каждая буква в открытом тексте заменяется буквой на некоторое
# фиксированное количество позиций вниз по алфавиту. Например, со сдвигом влево 3, D будет заменен на A,
# E станет Б, и так далее. Метод назван в честь Юлия Цезаря, который использовал его в своей частной переписке.

# Задача.
# Считайте файл message.txt и зашифруйте  текст шифром Цезаря, при этом символы первой строки файла должны
# циклически сдвигаться влево на 1, второй строки — на 2, третьей строки — на три и т.д.
# В этой задаче удобно считывать файл построчно, шифруя каждую строку в отдельности.
# В каждой строчке содержатся различные символы. Шифровать нужно только буквы кириллицы.



alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"

with open("message.txt", "r") as file:
    encrypted_text = []
    text = file.readlines()
    for line_num in range(len(text)):
        new_line = ""
        for char in text[line_num]:
            if char.lower() in alphabet:
                char_ind = alphabet.find(char.lower())
                if char.isupper():
                    new_line += alphabet[char_ind-(line_num+1)].upper()
                else:
                    new_line += alphabet[char_ind-(line_num+1)]
                continue
            new_line += char
        encrypted_text.append(new_line)
    for encrypted_line in encrypted_text:
        print(encrypted_line)
