#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
a,b = int(input("Введите первое число: ")), int(input("Введите второе число: "))
print (f"Сумма равна {a+b}")
print (f"Разность равна {a-b}")
print (f"Частное равно {a/b}")
print (f"Произведение равно {a*b}")
print (f"Целочисленное деление равно {a//b}")
print (f"Деление с остатком равно {a%b}")
print (f"Возведение в степень равно {a**b}")
